#include <iostream>
#include <Windows.h>

int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Введення меж проміжку [a, b]
    int a, b;
    std::cout << "Введіть значення початоку проміжку: ";
    std::cin >> a;
    std::cout << "Введіть значення кінця проміжку: ";
    std::cin >> b;

    // Виведення результатів для кожного цілого x у проміжку [a, b]
    std::cout << "Результати функції y = (x^3 + 7) / x для x у проміжку [" << a << ", " << b << "]:" << std::endl;
    for (int x = a; x <= b; ++x) {
        // Виконання обчислень функції
        double y = static_cast<double>(x * x * x + 7) / x;

        // Виведення результатів
        std::cout << "x = " << x << ", y = " << y << std::endl;

        // Якщо ви хочете обмежити кількість виведених результатів, можна використовувати break після певної кількості ітерацій.
    }

    return 0;
}
