#include <iostream>
#include <Windows.h>

int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Ââåäåííÿ ìåæ ïðîì³æêó [a, b]
    int a, b;
    std::cout << "Ââåä³òü çíà÷åííÿ ïî÷àòîêó ïðîì³æêó: ";
    std::cin >> a;
    std::cout << "Ââåä³òü çíà÷åííÿ ê³íöÿ ïðîì³æêó: ";
    std::cin >> b;

    // Âèâåäåííÿ ðåçóëüòàò³â äëÿ êîæíîãî ö³ëîãî x ó ïðîì³æêó [a, b]
    std::cout << "Ðåçóëüòàòè ôóíêö³¿ y = (x^3 + 7) / x äëÿ x ó ïðîì³æêó [" << a << ", " << b << "]:" << std::endl;
    for (int x = a; x <= b; ++x) {
        // Âèêîíàííÿ îá÷èñëåíü ôóíêö³¿
        double y = static_cast<double>(x * x * x + 7) / x;

        // Âèâåäåííÿ ðåçóëüòàò³â
        std::cout << "x = " << x << ", y = " << y << std::endl;

        // ßêùî âè õî÷åòå îáìåæèòè ê³ëüê³ñòü âèâåäåíèõ ðåçóëüòàò³â, ìîæíà âèêîðèñòîâóâàòè break ï³ñëÿ ïåâíî¿ ê³ëüêîñò³ ³òåðàö³é.
    }

    return 0;
}
